/*
	File:		SlicesStrings.strings

	Contains:
	Copyright:	© 2007-2009 by Apple Inc., all rights reserved.
*/

//===========================================================================
// NOTE FOR LOCALIZERS:
// For any attributes overridden using the MDSlicesAttributeNameOverrides
// strings file, special care must be taken here. The KEY of the strings
// here will change from its english version to the name override.  For example:
//
// If MDSlicesAttributeNameOverrides.strings contains:
//		kMDItemTextContent = "TEXTCONTENT";
//
// Then replace any use of "Contents" (the english localization) in the KEYS
// of this file with the localization provided in MDSlicesAttributeNameOverrides.strings.
//
// In the above example, the localizer should change the text content localization below from:
//		"%[Contents]@ contains %@" = "%1$[Contents]@ contains %2$@";  // english version
//	to:
//		"%[TEXTCONTENT]@ contains %@" = "%1$[TEXTCONTENT]@ xxxxxx %2$@"; // localized version
//===========================================================================

/* Compound-type slices */
"%[Any]@ of the following are true" = "%1$[Любой]@ из следующих являются правильными";
"%[All]@ of the following are true" = "%1$[Все]@ из следующих являются правильными";
"%[None]@ of the following are true" = "%1$[Ни один]@ из следующих являются правильными";

/* Specific kind strings */
"%[Kind]@ is %[any]@" = "%1$[Тип]@ – %2$[Любой]@";
"%[Kind]@ is %[applications]@" = "%1$[Тип]@ – %2$[Программ.]@";
"%[Kind]@ is %[documents]@" = "%1$[Тип]@ – %2$[Докум.]@";
"%[Kind]@ is %[folders]@" = "%1$[Тип]@ – %2$[Папк.]@";
"%[Kind]@ is %[images]@ %[all]@" = "%1$[Тип]@ – %2$[Изображ.]@ %3$[Все]@";
"%[Kind]@ is %[images]@ %[JPEG]@" = "%1$[Тип]@ – %2$[Изображ.]@ %3$[JPEG]@";
"%[Kind]@ is %[images]@ %[TIFF]@" = "%1$[Тип]@ – %2$[Изображ.]@ %3$[TIFF]@";
"%[Kind]@ is %[images]@ %[GIF]@" = "%1$[Тип]@ – %2$[Изображ.]@ %3$[GIF]@";
"%[Kind]@ is %[images]@ %[PNG]@" = "%1$[Тип]@ – %2$[Изображ.]@ %3$[PNG]@";
"%[Kind]@ is %[images]@ %[BMP]@" = "%1$[Тип]@ – %2$[Изображ.]@ %3$[BMP]@";
"%[Kind]@ is %[music]@ %[all]@" = "%1$[Тип]@ – %2$[Музыка]@ %3$[Все]@";
"%[Kind]@ is %[music]@ %[MP3]@" = "%1$[Тип]@ – %2$[Музыка]@ %3$[MP3]@";
"%[Kind]@ is %[music]@ %[AAC]@" = "%1$[Тип]@ – %2$[Музыка]@ %3$[AAC]@";
"%[Kind]@ is %[music]@ %[purchased]@" = "%1$[Тип]@ – %2$[Музыка]@ %3$[Купленное]@";
"%[Kind]@ is %[PDF]@" = "%1$[Тип]@ – %2$[PDF]@";
"%[Kind]@ is %[presentations]@" = "%1$[Тип]@ – %2$[Презентация]@";
"%[Kind]@ is %[text]@ %[all]@" = "%1$[Тип]@ – %2$[Текст]@ %3$[Все]@";
"%[Kind]@ is %[text]@ %[plain text]@" = "%1$[Тип]@ – %2$[Текст]@ %3$[Простой текст]@";
"%[Kind]@ is %[text]@ %[rich text]@" = "%1$[Тип]@ – %2$[Текст]@ %3$[RTF]@";
"%[Kind]@ is %[text]@ %[HTML]@" = "%1$[Тип]@ – %2$[Текст]@ %3$[HTML]@";
"%[Kind]@ is %[text]@ %[XML]@" = "%1$[Тип]@ – %2$[Текст]@ %3$[XML]@";
"%[Kind]@ is %[text]@ %[source code]@" = "%1$[Тип]@ – %2$[Текст]@ %3$[Код источника]@";
"%[Kind]@ is %[movies]@" = "%1$[Тип]@ – %2$[Фильм]@";
"%[Kind]@ is %[other]@ %@" = "%1$[Тип]@ – %2$[Другое]@ %3$@";

/* date-type attribute template, like kMDItemContentCreationDate */
"%@ is %[within last]@ %@ %[days]@" = "%1$@ – %2$[за посл.]@ %3$@ %4$[дн.]@";
"%@ is %[within last]@ %@ %[weeks]@" = "%1$@ – %2$[за посл.]@ %3$@ %4$[нед.]@";
"%@ is %[within last]@ %@ %[months]@" = "%1$@ – %2$[за посл.]@ %3$@ %4$[мес.]@";
"%@ is %[within last]@ %@ %[years]@" = "%1$@ – %2$[за посл.]@ %3$@ %4$[гг.]@";
"%@ is %[exactly]@ %@" = "%1$@ – %2$[точно]@ %3$@";
"%@ is %[before]@ %@" = "%1$@ – %2$[до]@ %3$@";
"%@ is %[after]@ %@" = "%1$@ – %2$[после]@ %3$@";
"%@ is %[today]@" = "%1$@ - %2$[сегодня]@";
"%@ is %[yesterday]@" = "%1$@ - %2$[вчера]@";
"%@ is %[this week]@" = "%1$@ - %2$[эта неделя]@";
"%@ is %[this month]@" = "%1$@ - %2$[этот месяц]@";
"%@ is %[this year]@" = "%1$@ - %2$[этот год]@";

/* string-type attribute, like kMDItemDisplayName */
"%@ %[contains]@ %@" = "%1$@ %2$[содержит]@ %3$@";
"%@ %[begins with]@ %@" = "%1$@ %2$[начинается с]@ %3$@";
"%@ %[ends with]@ %@" = "%1$@ %2$[заканчивается на]@ %3$@";
"%@ %[is]@ %@" = "%1$@ %2$[-]@ %3$@";
"%@ %[matches]@ %@" = "%1$@ %2$[сочетается с]@ %3$@";

/* boolean-type attribute, like kMDItemFlashOnOff */
"%@ %[any]@" = "%1$@ %2$[Люб.]@";
"%@ %[yes]@" = "%1$@ %2$[Да]@";
"%@ %[no]@" = "%1$@ %2$[Нет]@";

/* file visibility */
"%[File invisible]@ %[visible items]@" = "%1$[Видимость файла]@ %2$[Видимые объекты]@";
"%[File invisible]@ %[invisible items]@" = "%1$[Видимость файла]@ %2$[Невидимые объекты]@";
"%[File invisible]@ %[visible or invisible]@" = "%1$[Видимость файла]@ %2$[Видимый или невидимый]@";

/* raw query slice */
"%[Raw query]@ %@" = "%1$[Запрос необработанных данных]@ %2$@";

/* file extension slice */
"%[File Extension]@ %[is]@ %@" = "%1$[Расширение файла]@ %2$[is]@ %3$@";

/* number-type attribute, like kMDItemAudioChannelCount */
"%@ %[equals]@ %@" = "%1$@ %2$[равен]@ %3$@";
"%@ %[is greater than]@ %@" = "%1$@ %2$[больше чем]@ %3$@";
"%@ %[is less than]@ %@" = "%1$@ %2$[меньше чем]@ %3$@";
"%@ %[is not]@ %@" = "%1$@ %2$[не]@ %3$@";

/* text contents */
"%@ contains %@" = "%1$@ содержит %2$@";

/* Byte-sized attributes, such as kMDItemFSSize */
"%@ %[equals]@ %@ %[KB]@" = "%1$@ %2$[равен]@ %3$@ %4$[КБ]@";
"%@ %[equals]@ %@ %[MB]@" = "%1$@ %2$[равен]@ %3$@ %4$[МБ]@";
"%@ %[equals]@ %@ %[GB]@" = "%1$@ %2$[равен]@ %3$@ %4$[ГБ]@";
"%@ %[is less than]@ %@ %[KB]@" = "%1$@ %2$[меньше чем]@ %3$@ %4$[КБ]@";
"%@ %[is less than]@ %@ %[MB]@" = "%1$@ %2$[меньше чем]@ %3$@ %4$[МБ]@";
"%@ %[is less than]@ %@ %[GB]@" = "%1$@ %2$[меньше чем]@ %3$@ %4$[ГБ]@";
"%@ %[is greater than]@ %@ %[KB]@" = "%1$@ %2$[больше чем]@ %3$@ %4$[КБ]@";
"%@ %[is greater than]@ %@ %[MB]@" = "%1$@ %2$[больше чем]@ %3$@ %4$[МБ]@";
"%@ %[is greater than]@ %@ %[GB]@" = "%1$@ %2$[больше чем]@ %3$@ %4$[ГБ]@";
"%@ %[is not]@ %@ %[KB]@" = "%1$@ %2$[не]@ %3$@ %4$[КБ]@";
"%@ %[is not]@ %@ %[MB]@" = "%1$@ %2$[не]@ %3$@ %4$[МБ]@";
"%@ %[is not]@ %@ %[GB]@" = "%1$@ %2$[не]@ %3$@ %4$[ГБ]@";

/* Duration-type attributes, such as kMDItemDurationSeconds */
"%@ %[equals]@ %@ hours %@ minutes %@ seconds" = "%1$@ %2$[равен]@ %3$@ час. %4$@ мин. %5$@ сек.";
"%@ %[is less than]@ %@ hours %@ minutes %@ seconds" = "%1$@ %2$[меньше чем]@ %3$@ час. %4$@ мин. %5$@ сек.";
"%@ %[is greater than]@ %@ hours %@ minutes %@ seconds" = "%1$@ %2$[больше чем]@ %3$@ час. %4$@ мин. %5$@ сек.";
"%@ %[is not]@ %@ hours %@ minutes %@ seconds" = "%1$@ %2$[не]@ %3$@ час. %4$@ мин. %5$@ сек.";

/* This is for the slice that is added when a search string is present in the search field when saving a search. */
"%[Items matching text]@ %@" = "%1$[Соответствующий объектам текст]@ %2$@";

/* Search System Files slice */
"%[SEARCH_SYSTEM_FILES]@ %[YES]@" = "%1$[Системные файлы]@ %2$[включены]@";
"%[SEARCH_SYSTEM_FILES]@ %[NO]@" = "%1$[Системные файлы]@ %2$[не включены]@";

/* Spotlight items slice */
"%[SEARCH_SPOTLIGHT_ITEMS]@ %[YES]@" = "%1$[Объекты Spotlight]@ %2$[включены]@";
"%[SEARCH_SPOTLIGHT_ITEMS]@ %[NO]@" = "%1$[Объекты Spotlight]@ %2$[не включены]@";

